In [1]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
obj = pd.Series([9,5,6,3])
obj

0    9
1    5
2    6
3    3
dtype: int64

In [5]:
obj.values

array([9, 5, 6, 3], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = pd.Series([9,-10,69,4], index=['d','b','a','c'])
obj2

d     9
b   -10
a    69
c     4
dtype: int64

In [8]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [9]:
obj2['b']

-10

In [10]:
obj2[['a','c','b']]

a    69
c     4
b   -10
dtype: int64

In [11]:
obj2[obj2>0]

d     9
a    69
c     4
dtype: int64

In [12]:
obj2*2

d     18
b    -20
a    138
c      8
dtype: int64

In [13]:
np.exp(obj2)

d    8.103084e+03
b    4.539993e-05
a    9.253782e+29
c    5.459815e+01
dtype: float64

In [14]:
'b' in obj2

True

In [15]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [16]:
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [17]:
states = ['California','Oregon','Texas','Ohio']

In [18]:
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Oregon        16000.0
Texas         71000.0
Ohio          35000.0
dtype: float64

In [19]:
pd.isnull(obj4)

California     True
Oregon        False
Texas         False
Ohio          False
dtype: bool

In [20]:
pd.notnull(obj4)

California    False
Oregon         True
Texas          True
Ohio           True
dtype: bool

In [21]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [22]:
obj4

California        NaN
Oregon        16000.0
Texas         71000.0
Ohio          35000.0
dtype: float64

In [23]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [24]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [25]:
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [26]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [27]:
pd.DataFrame(data, columns = ['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [28]:
pip install lxml

Requirement already satisfied: lxml in c:\users\qc\appdata\local\programs\python\python38\lib\site-packages (4.5.2)
Note: you may need to restart the kernel to use updated packages.

In [29]:
pip install --upgrade pip

Requirement already up-to-date: pip in c:\users\qc\appdata\local\programs\python\python38\lib\site-packages (20.2.2)
Note: you may need to restart the kernel to use updated packages.

In [30]:
df = pd.read_html("https://www.w3schools.com/html/html_tables.asp")
df

[                        Company           Contact  Country
 0           Alfreds Futterkiste      Maria Anders  Germany
 1    Centro comercial Moctezuma   Francisco Chang   Mexico
 2                  Ernst Handel     Roland Mendel  Austria
 3                Island Trading     Helen Bennett       UK
 4  Laughing Bacchus Winecellars   Yoshi Tannamuri   Canada
 5  Magazzini Alimentari Riuniti  Giovanni Rovelli    Italy,
           Tag                                        Description
 0     <table>                                    Defines a table
 1        <th>                   Defines a header cell in a table
 2        <tr>                           Defines a row in a table
 3        <td>                          Defines a cell in a table
 4   <caption>                            Defines a table caption
 5  <colgroup>  Specifies a group of one or more columns in a ...
 6       <col>  Specifies column properties for each column wi...
 7     <thead>               Groups the header content in a table
 8     <tbody>                 Groups the body content in a table
 9     <tfoot>               Groups the footer content in a table]

In [31]:
df[1]

          Tag                                        Description
0     <table>                                    Defines a table
1        <th>                   Defines a header cell in a table
2        <tr>                           Defines a row in a table
3        <td>                          Defines a cell in a table
4   <caption>                            Defines a table caption
5  <colgroup>  Specifies a group of one or more columns in a ...
6       <col>  Specifies column properties for each column wi...
7     <thead>               Groups the header content in a table
8     <tbody>                 Groups the body content in a table
9     <tfoot>               Groups the footer content in a table

In [32]:
d1 = {
    "Id":[1,2,3,4,5,6],
    "Name" : ["Mohsin","Hamza","Hassan","Jawad","Saad","Nelson"],
    "Course" : ["AI","BC","CNC","IOT","AI","IOT"],
    "Fee" : [5000,3000,3000,3500,4000,5000]
}
data1 = pd.DataFrame(d1)
data1

   Id    Name Course   Fee
0   1  Mohsin     AI  5000
1   2   Hamza     BC  3000
2   3  Hassan    CNC  3000
3   4   Jawad    IOT  3500
4   5    Saad     AI  4000
5   6  Nelson    IOT  5000

# Get General Infromation from your DataFrame

#dataframe.info()
#dataframe.describe()
#dataframe.dtypes
#dataframe.columns
#dataframe.index
#dataframe.values
#dataframe.isnull()
#dataframe.isnull().sum()
#dataframe.notnull()
#dataframe.notnull().sum()
#dataframe.head(n=5)
#dataframe.tail()
#dataframe.apply()     # pass user define function

In [33]:
data1.tail(2)

   Id    Name Course   Fee
4   5    Saad     AI  4000
5   6  Nelson    IOT  5000

In [34]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Id      6 non-null      int64
 1   Name    6 non-null      object
 2   Course  6 non-null      object
 3   Fee     6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 320.0+ bytes

In [35]:
data1.describe()

             Id          Fee
count  6.000000     6.000000
mean   3.500000  3916.666667
std    1.870829   917.423930
min    1.000000  3000.000000
25%    2.250000  3125.000000
50%    3.500000  3750.000000
75%    4.750000  4750.000000
max    6.000000  5000.000000

# Apply General Function on Series

#dataframe.column.apply() (pass user define function)
#dataframe.column.unique()
#dataframe.column.map() (pass dictionary (find key and replace with value))
#dataframe.column.value_counts()
#dataframe.columns.sum() #min,max,mean,std

In [36]:
data1

   Id    Name Course   Fee
0   1  Mohsin     AI  5000
1   2   Hamza     BC  3000
2   3  Hassan    CNC  3000
3   4   Jawad    IOT  3500
4   5    Saad     AI  4000
5   6  Nelson    IOT  5000

In [37]:
data1.Course.value_counts()

AI     2
IOT    2
CNC    1
BC     1
Name: Course, dtype: int64

In [38]:
data1.Fee.sum()

23500

In [39]:
data1.Course.unique()

array(['AI', 'BC', 'CNC', 'IOT'], dtype=object)

In [40]:
dmap = {
    "AI" : 0,
    "BC" : 1,
    "IOT" : 2,
    "CNC" : 3,
    np.nan : 4,
}

data1.Course.map(dmap)

0    0
1    1
2    3
3    2
4    0
5    2
Name: Course, dtype: int64

In [41]:
dic = {}

for i,v in enumerate(data1.Course.unique()):
    dic[v] = i

dic

{'AI': 0, 'BC': 1, 'CNC': 2, 'IOT': 3}

In [42]:
data1["Updated Courses"] = data1.Course.map(dic)
data1

   Id    Name Course   Fee  Updated Courses
0   1  Mohsin     AI  5000                0
1   2   Hamza     BC  3000                1
2   3  Hassan    CNC  3000                2
3   4   Jawad    IOT  3500                3
4   5    Saad     AI  4000                0
5   6  Nelson    IOT  5000                3

In [43]:
def updateFee(c):
    if c == "AI":
        return 7000
    elif c == "BC":
        return 4000
    elif c == "IOT":
        return 4500
    elif c == "CNC":
        return 4200
    else:
        return 0

data1["Updated Fee"] = data1.Course.apply(updateFee) 
data1

   Id    Name Course   Fee  Updated Courses  Updated Fee
0   1  Mohsin     AI  5000                0         7000
1   2   Hamza     BC  3000                1         4000
2   3  Hassan    CNC  3000                2         4200
3   4   Jawad    IOT  3500                3         4500
4   5    Saad     AI  4000                0         7000
5   6  Nelson    IOT  5000                3         4500

In [44]:
df2 = pd.DataFrame(np.random.randint(1,100, size=(6,5)),columns=['A','B','C','D','E'])
df2

    A   B   C   D   E
0  73  53  81  90  87
1  22  34  26  32  65
2  45  84  50  46  62
3   5  33  15  82  48
4  23  78  22  76  11
5  42  18  95  52  30

In [45]:
pd.concat([data1,df2],axis=0)

,Id,Name,Course,Fee,Updated Courses,Updated Fee,A,B,C,D,E
0,1.0,Mohsin,AI,5000.0,0.0,7000.0,NaN,NaN,NaN,NaN,NaN
1,2.0,Hamza,BC,3000.0,1.0,4000.0,NaN,NaN,NaN,NaN,NaN
2,3.0,Hassan,CNC,3000.0,2.0,4200.0,NaN,NaN,NaN,NaN,NaN
3,4.0,Jawad,IOT,3500.0,3.0,4500.0,NaN,NaN,NaN,NaN,NaN
4,5.0,Saad,AI,4000.0,0.0,7000.0,NaN,NaN,NaN,NaN,NaN
5,6.0,Nelson,IOT,5000.0,3.0,4500.0,NaN,NaN,NaN,NaN,NaN
0,NaN,NaN,NaN,NaN,NaN,NaN,73.0,53.0,81.0,90.0,87.0
1,NaN,NaN,NaN,NaN,NaN,NaN,22.0,34.0,26.0,32.0,65.0
2,NaN,NaN,NaN,NaN,NaN,NaN,45.0,84.0,50.0,46.0,62.0
3,NaN,NaN,NaN,NaN,NaN,NaN,5.0,33.0,15.0,82.0,48.0
4,NaN,NaN,NaN,NaN,NaN,NaN,23.0,78.0,22.0,76.0,11.0
5,NaN,NaN,NaN,NaN,NaN,NaN,42.0,18.0,95.0,52.0,30.0

In [46]:
df3 = pd.concat([data1,df2],axis=1)
df3

   Id    Name Course   Fee  Updated Courses  Updated Fee   A   B   C   D   E
0   1  Mohsin     AI  5000                0         7000  73  53  81  90  87
1   2   Hamza     BC  3000                1         4000  22  34  26  32  65
2   3  Hassan    CNC  3000                2         4200  45  84  50  46  62
3   4   Jawad    IOT  3500                3         4500   5  33  15  82  48
4   5    Saad     AI  4000                0         7000  23  78  22  76  11
5   6  Nelson    IOT  5000                3         4500  42  18  95  52  30

In [47]:
df3["Total"] = df3.A + df3.B + df3.C + df3.D + df3.E 
df3["Percentage"] = (df3.A + df3.B + df3.C + df3.D + df3.E)/500*100 

def grade(p):
    if p>=90:
        return "A"
    elif p>=80:
        return "B+"
    elif p>=70:
        return "B"
    elif p>60:
        return "C+"
    elif p>50:
        return "C"
    else:
        return "Fail"

df3["Grade"] = df3.Percentage.apply(grade)
df3

,Id,Name,Course,Fee,Updated Courses,Updated Fee,A,B,C,D,E,Total,Percentage,Grade
0,1,Mohsin,AI,5000,0,7000,73,53,81,90,87,384,76.8,B
1,2,Hamza,BC,3000,1,4000,22,34,26,32,65,179,35.8,Fail
2,3,Hassan,CNC,3000,2,4200,45,84,50,46,62,287,57.4,C
3,4,Jawad,IOT,3500,3,4500,5,33,15,82,48,183,36.6,Fail
4,5,Saad,AI,4000,0,7000,23,78,22,76,11,210,42.0,Fail
5,6,Nelson,IOT,5000,3,4500,42,18,95,52,30,237,47.4,Fail

course = A.I->c1..c5.sum()
course = AIOT->c1..c5.product()
course = CNC->c1..c5.cumsum().sum()
course = A.I->c1..c5. 0

In [48]:
def user_fn(course,c1,c2,c3,c4,c5):
    if course == "AI":
        return np.array([c1,c2,c3,c4,c5]).sum()
    elif course == "IOT":
        return np.array([c1,c2,c3,c4,c5]).prod()
    elif course == "CNC":
        return sum(np.array([c1,c2,c3,c4,c5]).cumsum())
    else:
        return "0"

df3["Validation"] = df3[["Course","A","B","C","D","E"]].apply(lambda x:user_fn(*x),axis=1)
df3

,Id,Name,Course,Fee,Updated Courses,Updated Fee,A,B,C,D,E,Total,Percentage,Grade,Validation
0,1,Mohsin,AI,5000,0,7000,73,53,81,90,87,384,76.8,B,384
1,2,Hamza,BC,3000,1,4000,22,34,26,32,65,179,35.8,Fail,0
2,3,Hassan,CNC,3000,2,4200,45,84,50,46,62,287,57.4,C,865
3,4,Jawad,IOT,3500,3,4500,5,33,15,82,48,183,36.6,Fail,9741600
4,5,Saad,AI,4000,0,7000,23,78,22,76,11,210,42.0,Fail,210
5,6,Nelson,IOT,5000,3,4500,42,18,95,52,30,237,47.4,Fail,112039200

# Sort
Value     
Index

In [49]:
df3.sort_index(ascending=False)

,Id,Name,Course,Fee,Updated Courses,Updated Fee,A,B,C,D,E,Total,Percentage,Grade,Validation
5,6,Nelson,IOT,5000,3,4500,42,18,95,52,30,237,47.4,Fail,112039200
4,5,Saad,AI,4000,0,7000,23,78,22,76,11,210,42.0,Fail,210
3,4,Jawad,IOT,3500,3,4500,5,33,15,82,48,183,36.6,Fail,9741600
2,3,Hassan,CNC,3000,2,4200,45,84,50,46,62,287,57.4,C,865
1,2,Hamza,BC,3000,1,4000,22,34,26,32,65,179,35.8,Fail,0
0,1,Mohsin,AI,5000,0,7000,73,53,81,90,87,384,76.8,B,384

In [50]:
df3.sort_index(ascending=False, axis=1)

,Validation,Updated Fee,Updated Courses,Total,Percentage,Name,Id,Grade,Fee,E,D,Course,C,B,A
0,384,7000,0,384,76.8,Mohsin,1,B,5000,87,90,AI,81,53,73
1,0,4000,1,179,35.8,Hamza,2,Fail,3000,65,32,BC,26,34,22
2,865,4200,2,287,57.4,Hassan,3,C,3000,62,46,CNC,50,84,45
3,9741600,4500,3,183,36.6,Jawad,4,Fail,3500,48,82,IOT,15,33,5
4,210,7000,0,210,42.0,Saad,5,Fail,4000,11,76,AI,22,78,23
5,112039200,4500,3,237,47.4,Nelson,6,Fail,5000,30,52,IOT,95,18,42

# Sort by value 
#df.sort_values("C1") 
#df.sort_values(by=[c1,c2,c3],ascending=[True,True,False] )

In [51]:
df3.sort_values("Percentage",ascending=False)

,Id,Name,Course,Fee,Updated Courses,Updated Fee,A,B,C,D,E,Total,Percentage,Grade,Validation
0,1,Mohsin,AI,5000,0,7000,73,53,81,90,87,384,76.8,B,384
2,3,Hassan,CNC,3000,2,4200,45,84,50,46,62,287,57.4,C,865
5,6,Nelson,IOT,5000,3,4500,42,18,95,52,30,237,47.4,Fail,112039200
4,5,Saad,AI,4000,0,7000,23,78,22,76,11,210,42.0,Fail,210
3,4,Jawad,IOT,3500,3,4500,5,33,15,82,48,183,36.6,Fail,9741600
1,2,Hamza,BC,3000,1,4000,22,34,26,32,65,179,35.8,Fail,0

In [52]:
df3.sort_values(by=["Course","Percentage"],ascending=[True,False])

,Id,Name,Course,Fee,Updated Courses,Updated Fee,A,B,C,D,E,Total,Percentage,Grade,Validation
0,1,Mohsin,AI,5000,0,7000,73,53,81,90,87,384,76.8,B,384
4,5,Saad,AI,4000,0,7000,23,78,22,76,11,210,42.0,Fail,210
1,2,Hamza,BC,3000,1,4000,22,34,26,32,65,179,35.8,Fail,0
2,3,Hassan,CNC,3000,2,4200,45,84,50,46,62,287,57.4,C,865
5,6,Nelson,IOT,5000,3,4500,42,18,95,52,30,237,47.4,Fail,112039200
3,4,Jawad,IOT,3500,3,4500,5,33,15,82,48,183,36.6,Fail,9741600

# Loaded Titanic Dataset

In [53]:
df = pd.read_csv("./titanic/train.csv")
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [54]:
for v in df.Survived.unique():
    print(v, len(df[df.Survived==v]))

0 549
1 342

In [55]:
df.Survived.value_counts()

0    549
1    342
Name: Survived, dtype: int64

### Data Wragling (Joining)
- df.merge()
- df.join()
- pd.concat()
### Group By
### Handling Missing Values

In [77]:
dtf = pd.DataFrame({
    "CNIC" : np.random.randint(1,20 , size=20),
    "Account No" : np.random.randint(1,5 , size=20)
})
dtf

    CNIC  Account No
0      3           4
1     10           3
2     11           1
3     17           2
4     13           3
5      3           3
6      3           2
7     18           3
8      2           2
9     14           4
10    19           4
11    12           4
12     9           3
13    15           1
14    15           2
15    18           3
16    10           1
17    18           2
18    19           3
19    14           3

In [78]:
dtf1 = pd.DataFrame({"CNIC": np.random.randint(1,20, size=(20)),
                   "Account No":np.random.randint(1,5, size=(20)),
                   "Mobile No":np.random.randint(2001,3000, size=(20)),
                  "DOB":pd.date_range('1990-01-01', periods=20, freq="M"),
                  "CustomerName":[chr(x) for x in np.random.randint(65,91, size=(20))],
                   "Gender":np.random.choice(["M","F"], size=(20))})
dtf1

    CNIC  Account No  Mobile No        DOB CustomerName Gender
0      3           2       2321 1990-01-31            O      F
1     14           2       2428 1990-02-28            E      F
2      5           4       2565 1990-03-31            N      M
3      8           2       2716 1990-04-30            F      M
4      4           2       2036 1990-05-31            T      M
5     10           1       2406 1990-06-30            S      F
6      5           2       2337 1990-07-31            H      M
7      5           2       2008 1990-08-31            K      F
8     16           3       2246 1990-09-30            P      M
9      2           1       2958 1990-10-31            U      F
10     9           1       2914 1990-11-30            A      F
11    15           2       2851 1990-12-31            O      M
12    13           4       2831 1991-01-31            X      F
13    11           1       2816 1991-02-28            G      M
14    19           4       2298 1991-03-31            A      F
15    15           2       2335 1991-04-30            N      M
16     4           1       2794 1991-05-31            Z      F
17    15           1       2261 1991-06-30            S      M
18    15           3       2293 1991-07-31            H      F
19    17           4       2705 1991-08-31            U      M

In [79]:
#data_frame_left.merge(dataframe_right, on="columnNameSameInBothDataframes", how="typeofJoin")
#typeofJoin=inner,outer,left,right

#data_frame_left.merge(dataframe_right, on=[col1,col2,col3], how="typeofJoin")

#data_frame_left.merge(dataframe_right, on=[col1,col2,col3], how="typeofJoin")

#if columns name differents in both table 

#data_frame_left.merge(dataframe_right, left_on="col", right_on="col", how="typeofJoin")

#data_frame_left.merge(dataframe_right, left_index=True, right_index=True, how='outer')

print(dtf.dtypes, dtf1.dtypes, sep="\n\n\n")

CNIC          int32
Account No    int32
dtype: object


CNIC                     int32
Account No               int32
Mobile No                int32
DOB             datetime64[ns]
CustomerName            object
Gender                  object
dtype: object

<img src="https://www.w3schools.com/sql/img_innerjoin.gif">

<img src="https://www.w3schools.com/sql/img_leftjoin.gif">

<img src="https://www.w3schools.com/sql/img_rightjoin.gif">

<img src="https://www.w3schools.com/sql/img_fulljoin.gif">

In [80]:
#data_frame_left.merge(dataframe_right, on="columnNameSameInBothDataframes", how="typeofJoin")
a = dtf.merge(dtf1, on="CNIC", how="inner")
a

    CNIC  Account No_x  Account No_y  Mobile No        DOB CustomerName Gender
0      3             4             2       2321 1990-01-31            O      F
1      3             3             2       2321 1990-01-31            O      F
2      3             2             2       2321 1990-01-31            O      F
3     10             3             1       2406 1990-06-30            S      F
4     10             1             1       2406 1990-06-30            S      F
5     11             1             1       2816 1991-02-28            G      M
6     17             2             4       2705 1991-08-31            U      M
7     13             3             4       2831 1991-01-31            X      F
8      2             2             1       2958 1990-10-31            U      F
9     14             4             2       2428 1990-02-28            E      F
10    14             3             2       2428 1990-02-28            E      F
11    19             4             4       2298 1991-03-31            A      F
12    19             3             4       2298 1991-03-31            A      F
13     9             3             1       2914 1990-11-30            A      F
14    15             1             2       2851 1990-12-31            O      M
15    15             1             2       2335 1991-04-30            N      M
16    15             1             1       2261 1991-06-30            S      M
17    15             1             3       2293 1991-07-31            H      F
18    15             2             2       2851 1990-12-31            O      M
19    15             2             2       2335 1991-04-30            N      M
20    15             2             1       2261 1991-06-30            S      M
21    15             2             3       2293 1991-07-31            H      F

In [81]:
#data_frame_left.merge(dataframe_right, on=[col1,col2,col3], how="typeofJoin")
a = dtf.merge(dtf1, on=["CNIC","Account No"], how="inner")
a

   CNIC  Account No  Mobile No        DOB CustomerName Gender
0    11           1       2816 1991-02-28            G      M
1     3           2       2321 1990-01-31            O      F
2    19           4       2298 1991-03-31            A      F
3    15           1       2261 1991-06-30            S      M
4    15           2       2851 1990-12-31            O      M
5    15           2       2335 1991-04-30            N      M
6    10           1       2406 1990-06-30            S      F

In [82]:
a = dtf.merge(dtf1, on=["CNIC","Account No"], how="left")
a

    CNIC  Account No  Mobile No        DOB CustomerName Gender
0      3           4        NaN        NaT          NaN    NaN
1     10           3        NaN        NaT          NaN    NaN
2     11           1     2816.0 1991-02-28            G      M
3     17           2        NaN        NaT          NaN    NaN
4     13           3        NaN        NaT          NaN    NaN
5      3           3        NaN        NaT          NaN    NaN
6      3           2     2321.0 1990-01-31            O      F
7     18           3        NaN        NaT          NaN    NaN
8      2           2        NaN        NaT          NaN    NaN
9     14           4        NaN        NaT          NaN    NaN
10    19           4     2298.0 1991-03-31            A      F
11    12           4        NaN        NaT          NaN    NaN
12     9           3        NaN        NaT          NaN    NaN
13    15           1     2261.0 1991-06-30            S      M
14    15           2     2851.0 1990-12-31            O      M
15    15           2     2335.0 1991-04-30            N      M
16    18           3        NaN        NaT          NaN    NaN
17    10           1     2406.0 1990-06-30            S      F
18    18           2        NaN        NaT          NaN    NaN
19    19           3        NaN        NaT          NaN    NaN
20    14           3        NaN        NaT          NaN    NaN

In [83]:
a = dtf.merge(dtf1, on=["CNIC","Account No"], how="right")
a

    CNIC  Account No  Mobile No        DOB CustomerName Gender
0      3           2       2321 1990-01-31            O      F
1     14           2       2428 1990-02-28            E      F
2      5           4       2565 1990-03-31            N      M
3      8           2       2716 1990-04-30            F      M
4      4           2       2036 1990-05-31            T      M
5     10           1       2406 1990-06-30            S      F
6      5           2       2337 1990-07-31            H      M
7      5           2       2008 1990-08-31            K      F
8     16           3       2246 1990-09-30            P      M
9      2           1       2958 1990-10-31            U      F
10     9           1       2914 1990-11-30            A      F
11    15           2       2851 1990-12-31            O      M
12    15           2       2335 1991-04-30            N      M
13    13           4       2831 1991-01-31            X      F
14    11           1       2816 1991-02-28            G      M
15    19           4       2298 1991-03-31            A      F
16     4           1       2794 1991-05-31            Z      F
17    15           1       2261 1991-06-30            S      M
18    15           3       2293 1991-07-31            H      F
19    17           4       2705 1991-08-31            U      M

In [84]:
a = dtf.merge(dtf1, on=["CNIC","Account No"], how="outer")
a

    CNIC  Account No  Mobile No        DOB CustomerName Gender
0      3           4        NaN        NaT          NaN    NaN
1     10           3        NaN        NaT          NaN    NaN
2     11           1     2816.0 1991-02-28            G      M
3     17           2        NaN        NaT          NaN    NaN
4     13           3        NaN        NaT          NaN    NaN
5      3           3        NaN        NaT          NaN    NaN
6      3           2     2321.0 1990-01-31            O      F
7     18           3        NaN        NaT          NaN    NaN
8     18           3        NaN        NaT          NaN    NaN
9      2           2        NaN        NaT          NaN    NaN
10    14           4        NaN        NaT          NaN    NaN
11    19           4     2298.0 1991-03-31            A      F
12    12           4        NaN        NaT          NaN    NaN
13     9           3        NaN        NaT          NaN    NaN
14    15           1     2261.0 1991-06-30            S      M
15    15           2     2851.0 1990-12-31            O      M
16    15           2     2335.0 1991-04-30            N      M
17    10           1     2406.0 1990-06-30            S      F
18    18           2        NaN        NaT          NaN    NaN
19    19           3        NaN        NaT          NaN    NaN
20    14           3        NaN        NaT          NaN    NaN
21    14           2     2428.0 1990-02-28            E      F
22     5           4     2565.0 1990-03-31            N      M
23     8           2     2716.0 1990-04-30            F      M
24     4           2     2036.0 1990-05-31            T      M
25     5           2     2337.0 1990-07-31            H      M
26     5           2     2008.0 1990-08-31            K      F
27    16           3     2246.0 1990-09-30            P      M
28     2           1     2958.0 1990-10-31            U      F
29     9           1     2914.0 1990-11-30            A      F
30    13           4     2831.0 1991-01-31            X      F
31     4           1     2794.0 1991-05-31            Z      F
32    15           3     2293.0 1991-07-31            H      F
33    17           4     2705.0 1991-08-31            U      M

In [61]:
dtf.columns = ['Customer CNIC', 'Customer Account No']
dtf.head(2)

   Customer CNIC  Customer Account No
0             19                    2
1             11                    4

In [62]:
#data_frame_left.merge(dataframe_right, left_on="col", right_on="col", how="typeofJoin")
a = dtf.merge(dtf1, left_on="Customer CNIC", right_on="CNIC")
a

,Customer CNIC,Customer Account No,CNIC,Account No,Mobile No,DOB,CustomerName,Gender
0,19,2,19,2,2915,1990-08-31,V,M
1,19,4,19,2,2915,1990-08-31,V,M
2,19,2,19,2,2915,1990-08-31,V,M
3,11,4,11,2,2305,1991-03-31,D,M
4,11,2,11,2,2305,1991-03-31,D,M
5,6,2,6,4,2517,1990-04-30,L,F
6,18,4,18,3,2979,1990-02-28,M,F
7,18,4,18,3,2427,1991-02-28,A,F
8,18,3,18,3,2979,1990-02-28,M,F
9,18,3,18,3,2427,1991-02-28,A,F
10,13,3,13,3,2966,1990-06-30,E,F
11,13,3,13,1,2392,1991-08-31,O,F
12,13,4,13,3,2966,1990-06-30,E,F
13,13,4,13,1,2392,1991-08-31,O,F
14,13,1,13,3,2966,1990-06-30,E,F
15,13,1,13,1,2392,1991-08-31,O,F
16,9,1,9,3,2989,1990-12-31,Y,M
17,7,3,7,3,2558,1990-11-30,M,M
18,15,2,15,1,2185,1990-09-30,B,M
19,15,2,15,1,2185,1990-09-30,B,M
20,4,3,4,1,2767,1991-04-30,T,M
21,4,3,4,1,2425,1991-06-30,J,M
22,14,4,14,4,2341,1990-01-31,O,M

In [63]:
a = dtf.merge(dtf1, left_on=["Customer CNIC","Customer Account No"], right_on=["CNIC","Account No"])
a

,Customer CNIC,Customer Account No,CNIC,Account No,Mobile No,DOB,CustomerName,Gender
0,19,2,19,2,2915,1990-08-31,V,M
1,19,2,19,2,2915,1990-08-31,V,M
2,13,3,13,3,2966,1990-06-30,E,F
3,7,3,7,3,2558,1990-11-30,M,M
4,18,3,18,3,2979,1990-02-28,M,F
5,18,3,18,3,2427,1991-02-28,A,F
6,11,2,11,2,2305,1991-03-31,D,M
7,13,1,13,1,2392,1991-08-31,O,F
8,14,4,14,4,2341,1990-01-31,O,M

# Join with Index

In [64]:
customers = pd.DataFrame({"Customers NIC": [14,6,19],"Customer Name":["A","B","C"]})


transactions = pd.DataFrame({"CNIC": np.random.choice([14,6,19,21], size=(20)),
                   "TransactionID":np.random.randint(1,2, size=(20)),
                  "Transaction Date":pd.date_range('1990-01-01', periods=20),
                   "Description":np.random.choice(["M","F"], size=(20))})


customers

   Customers NIC Customer Name
0             14             A
1              6             B
2             19             C

In [65]:
transactions

    CNIC  TransactionID Transaction Date Description
0     19              1       1990-01-01           F
1     14              1       1990-01-02           M
2     21              1       1990-01-03           F
3     14              1       1990-01-04           M
4     19              1       1990-01-05           F
5     19              1       1990-01-06           F
6     19              1       1990-01-07           M
7     19              1       1990-01-08           F
8     14              1       1990-01-09           M
9     21              1       1990-01-10           F
10    14              1       1990-01-11           M
11    14              1       1990-01-12           F
12    14              1       1990-01-13           M
13    21              1       1990-01-14           F
14    19              1       1990-01-15           F
15    14              1       1990-01-16           F
16    14              1       1990-01-17           F
17    19              1       1990-01-18           F
18     6              1       1990-01-19           M
19    19              1       1990-01-20           F

In [66]:
c = transactions.CNIC.value_counts()
c

19    8
14    8
21    3
6     1
Name: CNIC, dtype: int64

In [67]:
a = customers.merge(c, left_on="Customers NIC", right_index=True)
a

   Customers NIC Customer Name  CNIC
0             14             A     8
1              6             B     1
2             19             C     8

In [75]:
a.columns = ['Customers NIC', 'Customer Name', 'Tr counts']
a

   Customers NIC Customer Name  Tr counts
0             14             A          8
1              6             B          1
2             19             C          8

In [93]:
customers = pd.DataFrame({"Customers NIC": [14,6,19],"Customer Name":["A","B","C"]})

transactions = pd.DataFrame({"CNIC": np.random.choice([14,6,19,21], size=(20)),
                   "TransactionID":np.random.randint(1,2, size=(20)),
                  "Transaction Date":pd.date_range('1990-01-01', periods=20, freq='Y'),
                   "Description":np.random.choice(["M","F"], size=(20)),
                            "Actual Amount" : np.random.randint(1,10000, size=(20))
                            })
transactions.columns = ['CNIC', 'TransactionID', 'Transaction Date', 'Gender','Actual Amount']
transactions

    CNIC  TransactionID Transaction Date Gender  Actual Amount
0     14              1       1990-12-31      M           9703
1     21              1       1991-12-31      F           6514
2     19              1       1992-12-31      M           1128
3     19              1       1993-12-31      F           9895
4     21              1       1994-12-31      M           2228
5     21              1       1995-12-31      F            386
6     21              1       1996-12-31      M           4066
7      6              1       1997-12-31      F            143
8     19              1       1998-12-31      F           8294
9     21              1       1999-12-31      F           3716
10     6              1       2000-12-31      M           3705
11    14              1       2001-12-31      F           9363
12     6              1       2002-12-31      M           1086
13    14              1       2003-12-31      M           2770
14    21              1       2004-12-31      M           7438
15    14              1       2005-12-31      M           5985
16     6              1       2006-12-31      M            398
17     6              1       2007-12-31      M           8647
18     6              1       2008-12-31      F           6487
19    21              1       2009-12-31      M            495

# Group By

In [94]:
#dataframeName.groupby(by="").agg([count,min,max])
#dataframeName.groupby(by=[col1,col2,..]).agg([count,min,max])

c = transactions.groupby("Gender").agg(['count'])
c

        CNIC TransactionID Transaction Date Actual Amount
       count         count            count         count
Gender
F          8             8                8             8
M         12            12               12            12

In [97]:
c = transactions.groupby("Gender")[['CNIC']].agg(['count'])
c

        CNIC
       count
Gender
F          8
M         12

In [98]:
c = transactions.groupby([transactions['Transaction Date'].dt.year , "Gender"])[["CNIC"]].agg(['count'])
c

                         CNIC
                        count
Transaction Date Gender
1990             M          1
1991             F          1
1992             M          1
1993             F          1
1994             M          1
1995             F          1
1996             M          1
1997             F          1
1998             F          1
1999             F          1
2000             M          1
2001             F          1
2002             M          1
2003             M          1
2004             M          1
2005             M          1
2006             M          1
2007             M          1
2008             F          1
2009             M          1

In [99]:
c = transactions.groupby(["Gender","CNIC"])[["TransactionID"]].agg(['count'])
c

            TransactionID
                    count
Gender CNIC
F      6                2
       14               1
       19               2
       21               3
M      6                4
       14               3
       19               1
       21               4

In [100]:
c = transactions.groupby(["Gender","CNIC"])[["Actual Amount"]].agg(['count','sum','min','max'])
c

            Actual Amount
                    count    sum   min   max
Gender CNIC
F      6                2   6630   143  6487
       14               1   9363  9363  9363
       19               2  18189  8294  9895
       21               3  10616   386  6514
M      6                4  13836   398  8647
       14               3  18458  2770  9703
       19               1   1128  1128  1128
       21               4  14227   495  7438

### Slabs
- pd.cut(series)
- pd.qcut(series)

In [105]:
# df.ColumnName.cut()

pd.cut(transactions["Actual Amount"], 4).value_counts()

(133.248, 2581.0]    7
(7457.0, 9895.0]     5
(5019.0, 7457.0]     4
(2581.0, 5019.0]     4
Name: Actual Amount, dtype: int64

In [102]:
pd.cut(transactions["Actual Amount"], [1, 1000, 5000, 10000]).value_counts()

(5000, 10000]    9
(1000, 5000]     7
(1, 1000]        4
Name: Actual Amount, dtype: int64

In [103]:
pd.qcut(transactions["Actual Amount"], [.0, .50, .80, 1]).value_counts()

(142.999, 3891.0]    10
(3891.0, 8364.6]      6
(8364.6, 9895.0]      4
Name: Actual Amount, dtype: int64

# CHAPTER 7
- Data Cleaning and Preparation

### 7.1 Handling Missing Data

In [106]:
import matplotlib.pyplot as plt

In [107]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [108]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [109]:
string_data.notnull()

0     True
1     True
2    False
3     True
dtype: bool

In [110]:
string_data[string_data.notnull()]

0     aardvark
1    artichoke
3      avocado
dtype: object

In [111]:
string_data[0] = None

In [112]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

### Table 7-1. NA handling methods

In [114]:
string_data.duplicated()

0    False
1    False
2    False
3    False
dtype: bool

In [115]:
string_data.dropna()

1    artichoke
3      avocado
dtype: object

### Filtering Out Missing Data

In [116]:
from numpy import nan as NA
data = pd.Series([1,NA,3.5,NA,7])
print(data)
data.dropna()

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

0    1.0
2    3.5
4    7.0
dtype: float64

In [117]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [119]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [121]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [123]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -2.004882       NaN       NaN
1 -0.218629       NaN       NaN
2 -0.642866       NaN -1.292158
3 -2.013143       NaN -1.179614
4 -1.067775 -0.010809  0.963542
5 -0.181655  1.198771  1.151627
6  0.731902 -1.097870 -1.104524

In [124]:
df.dropna()

          0         1         2
4 -1.067775 -0.010809  0.963542
5 -0.181655  1.198771  1.151627
6  0.731902 -1.097870 -1.104524

In [125]:
df.dropna(thresh=2)

          0         1         2
2 -0.642866       NaN -1.292158
3 -2.013143       NaN -1.179614
4 -1.067775 -0.010809  0.963542
5 -0.181655  1.198771  1.151627
6  0.731902 -1.097870 -1.104524

### Filling In Missing Data

In [126]:
df

          0         1         2
0 -2.004882       NaN       NaN
1 -0.218629       NaN       NaN
2 -0.642866       NaN -1.292158
3 -2.013143       NaN -1.179614
4 -1.067775 -0.010809  0.963542
5 -0.181655  1.198771  1.151627
6  0.731902 -1.097870 -1.104524

In [127]:
df.fillna(0)

          0         1         2
0 -2.004882  0.000000  0.000000
1 -0.218629  0.000000  0.000000
2 -0.642866  0.000000 -1.292158
3 -2.013143  0.000000 -1.179614
4 -1.067775 -0.010809  0.963542
5 -0.181655  1.198771  1.151627
6  0.731902 -1.097870 -1.104524

In [128]:
df.fillna({1:5, 2:7})

          0         1         2
0 -2.004882  5.000000  7.000000
1 -0.218629  5.000000  7.000000
2 -0.642866  5.000000 -1.292158
3 -2.013143  5.000000 -1.179614
4 -1.067775 -0.010809  0.963542
5 -0.181655  1.198771  1.151627
6  0.731902 -1.097870 -1.104524

In [131]:
print(df.mean())
df.fillna(df.mean())

0   -0.771007
1    0.030031
2   -0.292226
dtype: float64

          0         1         2
0 -2.004882  0.030031 -0.292226
1 -0.218629  0.030031 -0.292226
2 -0.642866  0.030031 -1.292158
3 -2.013143  0.030031 -1.179614
4 -1.067775 -0.010809  0.963542
5 -0.181655  1.198771  1.151627
6  0.731902 -1.097870 -1.104524

In [132]:
df

          0         1         2
0 -2.004882       NaN       NaN
1 -0.218629       NaN       NaN
2 -0.642866       NaN -1.292158
3 -2.013143       NaN -1.179614
4 -1.067775 -0.010809  0.963542
5 -0.181655  1.198771  1.151627
6  0.731902 -1.097870 -1.104524

In [133]:
df.fillna(df.mean(), inplace=True)
df

          0         1         2
0 -2.004882  0.030031 -0.292226
1 -0.218629  0.030031 -0.292226
2 -0.642866  0.030031 -1.292158
3 -2.013143  0.030031 -1.179614
4 -1.067775 -0.010809  0.963542
5 -0.181655  1.198771  1.151627
6  0.731902 -1.097870 -1.104524

In [134]:
df = pd.DataFrame(np.random.randn(6, 3))
df

          0         1         2
0  0.190522  1.023230 -0.980802
1  0.583893  0.919870 -1.358107
2 -1.030181 -1.041868  0.903021
3 -0.697604 -0.016463 -2.278257
4 -0.795221 -1.017569  1.229266
5 -0.180167 -0.576906  1.584007

In [139]:
df.iloc[2:-1, 1] = NA
df.iloc[3:-1, 2] = NA
df

          0        1         2
0  0.190522  1.02323 -0.980802
1  0.583893  0.91987 -1.358107
2 -1.030181      NaN  0.903021
3 -0.697604      NaN       NaN
4 -0.795221      NaN       NaN
5 -0.180167      NaN       NaN

In [141]:
print(df)
df.fillna(method='ffill')

          0        1         2
0  0.190522  1.02323 -0.980802
1  0.583893  0.91987 -1.358107
2 -1.030181      NaN  0.903021
3 -0.697604      NaN       NaN
4 -0.795221      NaN       NaN
5 -0.180167      NaN       NaN

          0        1         2
0  0.190522  1.02323 -0.980802
1  0.583893  0.91987 -1.358107
2 -1.030181  0.91987  0.903021
3 -0.697604  0.91987  0.903021
4 -0.795221  0.91987  0.903021
5 -0.180167  0.91987  0.903021

In [142]:
print(df)
df.fillna(method='ffill', axis=1)

          0        1         2
0  0.190522  1.02323 -0.980802
1  0.583893  0.91987 -1.358107
2 -1.030181      NaN  0.903021
3 -0.697604      NaN       NaN
4 -0.795221      NaN       NaN
5 -0.180167      NaN       NaN

          0         1         2
0  0.190522  1.023230 -0.980802
1  0.583893  0.919870 -1.358107
2 -1.030181 -1.030181  0.903021
3 -0.697604 -0.697604 -0.697604
4 -0.795221 -0.795221 -0.795221
5 -0.180167 -0.180167 -0.180167

In [143]:
print(df)
df.fillna(method='bfill', axis=1)

          0        1         2
0  0.190522  1.02323 -0.980802
1  0.583893  0.91987 -1.358107
2 -1.030181      NaN  0.903021
3 -0.697604      NaN       NaN
4 -0.795221      NaN       NaN
5 -0.180167      NaN       NaN

          0         1         2
0  0.190522  1.023230 -0.980802
1  0.583893  0.919870 -1.358107
2 -1.030181  0.903021  0.903021
3 -0.697604       NaN       NaN
4 -0.795221       NaN       NaN
5 -0.180167       NaN       NaN

### 7.2 Data Transformation

### Removing Duplicates

In [144]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [145]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [146]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [147]:
data.drop_duplicates(subset="k1")

    k1  k2
0  one   1
1  two   1

In [148]:
data.drop_duplicates(subset=["k1", "k2"])

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [149]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [150]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [151]:
data.drop_duplicates(subset=["k1", "k2"], keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [152]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [153]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [154]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [156]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [157]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [158]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [159]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [161]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [162]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [163]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes

In [164]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [171]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [175]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [177]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [178]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [179]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### Discretization and Binning

In [184]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
slab = [18,25,40,60,120]
cat = pd.cut(ages,slab)
cat

[(18, 25], (18, 25], (18, 25], (25, 40], (18, 25], ..., (25, 40], (60, 120], (40, 60], (40, 60], (25, 40]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 40] < (40, 60] < (60, 120]]

In [185]:
cat.codes

array([0, 0, 0, 1, 0, 0, 1, 1, 3, 2, 2, 1], dtype=int8)

In [186]:
cat.categories

IntervalIndex([(18, 25], (25, 40], (40, 60], (60, 120]],
              closed='right',
              dtype='interval[int64]')

In [187]:
cat.value_counts()

(18, 25]     5
(25, 40]     4
(40, 60]     2
(60, 120]    1
dtype: int64

In [188]:
pd.cut(ages, slab, right=False)

[[18, 25), [18, 25), [25, 40), [25, 40), [18, 25), ..., [25, 40), [60, 120), [40, 60), [40, 60), [25, 40)]
Length: 12
Categories (4, interval[int64]): [[18, 25) < [25, 40) < [40, 60) < [60, 120)]

In [190]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, slab, right=False, labels=group_names)

['Youth', 'Youth', 'YoungAdult', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [192]:
data = np.random.rand(20)
pd.cut(data, 4).value_counts()

(0.0581, 0.284]    8
(0.284, 0.51]      9
(0.51, 0.735]      0
(0.735, 0.96]      3
dtype: int64

In [193]:
data = np.random.randn(1000) # Normally distributed
cats = pd.qcut(data, 4) # Cut into quartiles
cats

[(-0.0216, 0.636], (-0.621, -0.0216], (-3.052, -0.621], (-0.0216, 0.636], (-0.0216, 0.636], ..., (0.636, 3.355], (-0.0216, 0.636], (-3.052, -0.621], (0.636, 3.355], (0.636, 3.355]]
Length: 1000
Categories (4, interval[float64]): [(-3.052, -0.621] < (-0.621, -0.0216] < (-0.0216, 0.636] < (0.636, 3.355]]

In [194]:
cats.value_counts()

(-3.052, -0.621]     250
(-0.621, -0.0216]    250
(-0.0216, 0.636]     250
(0.636, 3.355]       250
dtype: int64

In [195]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]).value_counts()

(-3.052, -1.24]     100
(-1.24, -0.0216]    400
(-0.0216, 1.264]    400
(1.264, 3.355]      100
dtype: int64

### Detecting and Filtering Outliers

In [196]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.021096    -0.028170     0.019109     0.010628
std       1.010014     0.992105     0.978792     1.011225
min      -2.742097    -2.849336    -2.791148    -3.340780
25%      -0.730645    -0.723666    -0.644090    -0.651343
50%      -0.017789    -0.031365     0.013491    -0.007727
75%       0.696372     0.630092     0.757827     0.671559
max       3.189816     3.332376     3.146093     3.057612

In [197]:
col = data[2]
col

0     -0.500220
1      1.266946
2     -0.798130
3      1.878632
4     -0.626701
         ...
995    2.154303
996   -0.414100
997    1.301537
998   -1.818975
999    1.235652
Name: 2, Length: 1000, dtype: float64

In [198]:
col[np.abs(col) > 3]

160    3.146093
Name: 2, dtype: float64

In [199]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
160 -0.117680  0.259544  3.146093  0.490442
167  0.862313  3.332376 -1.263583 -0.166457
197  0.187826 -0.034416 -0.140573 -3.340780
232 -0.667691 -0.882298 -0.691142  3.057612
506  0.635257 -1.611522  0.912536 -3.020623
733  3.189816  0.489454 -0.238441  1.797607
858  0.675614  0.874429 -1.272484 -3.049486

In [200]:
data[np.abs(data) > 3] = np.sign(data) * 3
data

            0         1         2         3
0    1.702787 -0.152663 -0.500220  0.004177
1   -2.080250  1.404397  1.266946 -0.300930
2    1.754379 -1.326146 -0.798130 -0.978688
3   -1.353491 -0.695896  1.878632  0.612469
4   -0.347752 -1.233096 -0.626701 -0.128784
..        ...       ...       ...       ...
995 -0.385894  1.392838  2.154303 -0.156676
996 -0.364798  1.486816 -0.414100  0.030063
997 -0.376572 -0.003917  1.301537 -0.444716
998 -0.826188 -0.632683 -1.818975  0.039998
999 -1.754812 -0.366917  1.235652 -0.301664

[1000 rows x 4 columns]

In [201]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.021286    -0.028502     0.018963     0.010981
std       1.009427     0.991033     0.978336     1.009769
min      -2.742097    -2.849336    -2.791148    -3.000000
25%      -0.730645    -0.723666    -0.644090    -0.651343
50%      -0.017789    -0.031365     0.013491    -0.007727
75%       0.696372     0.630092     0.757827     0.671559
max       3.000000     3.000000     3.000000     3.000000

In [202]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0 -1.0  1.0
1 -1.0  1.0  1.0 -1.0
2  1.0 -1.0 -1.0 -1.0
3 -1.0 -1.0  1.0  1.0
4 -1.0 -1.0 -1.0 -1.0

### Permutation and Random Sampling

In [203]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [204]:
sampler = np.random.permutation(5)
sampler

array([2, 0, 1, 3, 4])

In [205]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
0   0   1   2   3
1   4   5   6   7
3  12  13  14  15
4  16  17  18  19

In [206]:
df.sample(n=3)

    0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [207]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

3    6
0    5
0    5
2   -1
3    6
1    7
4    4
1    7
1    7
0    5
dtype: int64

In [209]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=3)
draws

2   -1
1    7
0    5
dtype: int64

### Computing Indicator/Dummy Variables

In [210]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})

pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [211]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0